const authentication = {
  signIn: {
    name: 'Σύνδεση',
    text: 'Καταχώρησε τα στοιχεία σου για να συνδεθείς',
    forgot: 'Ξέχασα το όνομα χρήστη ή τον κωδικό πρόσβασης μου',
    create: 'Δημιουργία λογαριασμού'
  },
  signUp: {
    name: 'Δημιουργία λογαριασμού',
    text: '<p>Θα θέλατε να δοκιμάσετε το σύστημα και να διαχειριστείτε το δικό σας έργο;<p></p>Απλώς συμπλήρωσε τη φόρμα για να δημιουργήσετε έναν λογαριασμό.</p>',
    bySigningYouAgreeTo: 'Δημιουργώντας έναν λογαριασμό, μας επιβεβαιώνεις τους',
    terms: 'Όρους Χρήσης',
    andOur: 'και την',
    privacyPolicy: 'Πολιτική απορρήτου',
    signIn: 'Έχω ήδη λογαριασμό'
  },
  forgotPassword: {
    name: 'Ξέχασα το όνομα χρήστη ή τον κωδικό πρόσβασης μου',
    text: 'Πληκτρολόγησε το email σου και θα σου στείλουμε έναν σύνδεσμο για να επαναφέρεις τον κωδικό πρόσβασης σου. Αυτό θα σε συνδέσει και μπορείς επίσης να ελέγξεις το όνομα χρήστη σου.',
    button: 'Αποστολή συνδέσμου για επαναφορά',
    back: 'Επιστροφή στην σελίδα σύνδεσης',
    noUserForThisEmail: 'Κανένας χρήστης δεν βρέθηκε με ',
    multipleAccountsForThisEmail: 'Υπάρχουν διάφοροί χρήστες με αυτήν τη email. Επέλεξε ένα.',
    emailMissing: 'Εισαγωγή του email σου',
    mailSent: 'Θα πρέπει τώρα να έχετε λάβει ένα email. Αυτό περιλαμβάνει έναν σύνδεσμο που σας επιτρέπει να επαναφέρετε τον κωδικό πρόσβασής σας.'
  },
  resetPassword: {
    name: 'Επαναφορά κωδικού πρόσβασης',
    text: 'Εισαγάγετε νέο κωδικό πρόσβασης για {{0}}.',
    noUserFound: '<p>Αυτός ο σύνδεσμος δεν είναι έγκυρος.</p><p>Ζητήστε μια άλλη σύνδεση επαναφοράς.</p>',
    button: 'Επαναφορά κωδικού πρόσβασης',
    back: 'Επιστροφή στην σελίδα σύνδεσης'
  },
  firstLogin: {
    name: 'Καλώς ήλθατε',
    text: '<p>Ανυπομονούμε να σε καλωσορίσουμε.</p><p>Όρισε ένα όνομα χρήστη και έναν κωδικό πρόσβασης για το προφίλ σου. Με αυτά τα δεδομένα θα συνδέεσαι στο σύστημα στο μέλλον.</p><p>Τότε μπορείς να ξεκινήσεις.</p><p>Απόλαυσέ το!</p>',
    agreeTerms: 'Αποδέχομαι τους <a href="/de/terms" target="blank">Όρους Χρήσης</a> και την <a href="/de/privacy" target="blank">Πολιτική απορρήτου</a>',
    button: 'Πάμε!',
    tokenError: 'Ληγμένος  σύνδεσμος. Αυτός ο σύνδεσμος δεν ισχύει πλέον. Ζήτησε ένα νέο email ή προσπάθησε να επαναφέρεις τον κωδικό πρόσβασής σου.',
    tokenMissing: 'Μη έγκυρος σύνδεσμος. Χρησιμοποίησε το σύνδεσμο από το email.',
    plainTextToken: 'Φαίνεται ότι ο πελάτης αλληλογραφίας σου δεν υποστηρίζει HTML. Άνοιξε ξανά τη σύνδεση από ένα σύγχρονο πρόγραμμα αλληλογραφίας.',
    usernameExists: 'Το όνομα χρήστη χρησιμοποιείται ήδη. Επέλεξε άλλο.',
    usernameMissing: 'Εισαγάγετε ένα όνομα χρήστη.',
    agreeTermsMissing: 'Πρέπει να αποδεχτείς τους Όρους Χρήσης και την Πολιτική Απορρήτου.',
    usernameCannotBeEmail: 'Το όνομα χρήστη δεν πρέπει να είναι email. Δοκίμασε άλλο όνομα χρήστης.',
    buttonCreateAccount: 'Δημιουργία λογαριασμού',
    buttonHaveAccount: 'Έχω ήδη λογαριασμό'
  }
}

export default authentication
