const error = {
  '403': 'Υπάρχει ήδη ένας λογαριασμός με αυτό το όνομα χρήστης',
  nameRequired: 'Εισαγάγετε ένα όνομα για αυτό το πλοίο',
  callsignUnique: 'Ένα σκάφος με αυτό το σημείο κλήσης υπάρχει ήδη',
  eniUnique: 'Ένα πλοίο με αυτόν τον αριθμό ENI υπάρχει ήδη',
  imoUnique: 'Ένα πλοίο με αυτόν τον αριθμό ΙΜΟ υπάρχει ήδη',
  mmsiUnique: 'Ένα πλοίο με αυτόν τον αριθμό MMSI υπάρχει ήδη',
  missingField: 'Συμπληρώστε όλα τα πεδία',
  incorrectPassword: 'Αυτός ο κωδικός πρόσβασης δεν φαίνεται να ταιριάζει',
  noAccountFound: 'Δεν υπάρχει χρήστης με αυτό το όνομα χρήστη ή αυτό το email',
  multipleAccountsFound: 'Υπάρχουν διάφοροί χρήστες με αυτήν τη email. Επέλεξε ένα. Χρησιμοποίησε το όνομα χρήστη',
  passwordsDoNotMatch: 'Οι κωδικοί πρόσβασης δεν ταιριάζουν',
  passwordTooShort: 'Ο κωδικός πρόσβασης πρέπει να περιέχει τουλάχιστον 8 χαρακτήρες'
}

export default error
