const modal = {
  close: 'Κλείσιμο',
  addParticipant: {
    title: 'Προσθήκη συμμετέχον',
    description: 'Wähle die Verkündiger aus, die zu der Schicht hinzugefügt werden sollen.',
    search: 'Αναζήτηση ευαγγελιζομένου',
    addAsRequests: 'Προσθήκη ως υποψήφιο',
    addAsParticipants: 'Προσθήκη ως συμμετέχον'
  },
  addVessel: {
    title: 'Προσθήκη νέου πλοίου',
    action: 'Προσθήκη πλοίου'
  },
  addWeek: {
    title: 'Δημιουργία νέας εβδομάδας',
    noTemplate: 'Δημιούργησε πρώτα ένα πρότυπο',
    defineTemplate: 'Δημιουργία πρότυπο',
    action: 'Δημιουργία εβδομάδας',
    text: {
      top: 'Επέλεξε την εβδομάδα που θα εφαρμοστεί η εβδομάδα του προτύπου:',
      bottom: 'Επέλεξε την εβδομάδα του προτύπου:'
    }
  },
  cancelTeam: {
    title: 'Ακύρωση ομάδας',
    text: 'Περιέγραψε γιατί αυτή η ομάδα πρέπει να ακυρωθεί. Οι μεμονωμένοι ευαγγελιζόμενοι θα λάβουν αυτό το κείμενο στο email ακύρωσης.',
    action: 'Ακύρωση ομάδας'
  },
  copyShift: {
    title: 'Αντιγραφή βάρδιας',
    text: 'Επέλεξε τις ημέρες στις οποίες θέλεις να αντιγράψεις την βάρδια.',
    action: 'Αντιγραφή βάρδιας'
  },
  editShift: {
    title: 'Επεξεργασία στοιχείων βάρδιας',
    mainData: 'Γενικά δεδομένα',
    tag: 'Κατηγορία',
    team: 'Ομάδα',
    teams: 'Οι ομάδες αυτής της βάρδιας',
    helpText: {
      tag: 'Επέλεξε την κατηγορία στην οποία θα ανήκει η βάρδια. Όλοι οι ευαγγελιζόμενοί με άδεια για αυτήν την κατηγορία μπορούν να δουν την βάρδια.',
      scheduling: 'Για τις άμεσες δεσμεύσεις, οι αιτήσεις των ευαγγελιζόμενων θα εγκριθούν αμέσως μόλις επιτευχθεί το ελάχιστο όριο συμμετοχής της επόμενης ομάδας.'
    },
    addTeam: 'Δημιουργία νέας ομάδας',
    teamMin: 'Ελάχιστο όριο συμμετοχής:',
    teamMax: 'Μέγιστο όριο συμμετοχής:',
    teamStart: 'Αρχή:',
    teamEnd: 'Τέλος:',
    teamPlace: ':',
    removeTeam: 'Διαγραφή αυτής της ομάδας',
    noMeeting: 'Δεν υπάρχει τόπος συνάντησης',
    action: 'Δράση:',
    delete: 'Διαγραφή',
    switch: 'Διοργάνωσε την βάρδια',
    copyShift: 'Αντιγραφή βάρδιας'
  },
  editTeamPicture: {
    title: 'Αλλαγή εικόνας ομάδας',
    currentPicture: 'Τρέχουσα εικόνα:',
    hints: 'Αυτή η εικόνα ενδέχεται να εμφανίζεται μεγαλύτερη στον ευαγγελιζόμενο.',
    noPictureUploaded: 'Δεν ανέβασες ακόμα καμία εικόνα',
    upload: 'Μεταφόρτωσης',
    delete: 'Διαγραφή'
  },
  editMeetingPicture: {
    title: 'Αλλαγή εικόνας τόπου συναντήσεις',
    currentPicture: 'Τρέχουσα εικόνα:',
    hints: 'Αυτή η εικόνα ενδέχεται να εμφανίζεται μεγαλύτερη στον ευαγγελιζόμενο.',
    noPictureUploaded: 'Δεν ανέβασες ακόμα καμία εικόνα',
    upload: 'Μεταφόρτωσης',
    delete: 'Διαγραφή'
  },
  editVessel: {
    title: 'Αλλαγή δεδομένων πλοίου',
    action: 'Αποθήκευση αλλαγών'
  },
  inviteUser: {
    title: 'Πρόσκληση νέον ευαγγελιζομένων',
    key: '<span class="text-warning">Πορτοκαλί όνομα</span> σημαίνει ότι ο χρήστης έχει ήδη προσκληθεί.',
    selectAll: 'Επιλογή όλων',
    noUsers: 'Δεν βρέθηκαν νέοι ευαγγελιζόμενοι',
    invite: 'Πρόσκληση ευαγγελιζομένου'
  },
  position: {
    title: 'Σημειώστε τη θέση με το αριστερό πλήκτρο του ποντικιού'
  },
  shift: {
    clickToEnlarge: 'Κάνε κλικ στην εικόνα για μεγέθυνση',
    openLink: 'Άνοιγμα συνδεδεμένων πληροφοριών',
    meetingAt: 'Συνάντηση της',
    collapseTeam: 'Συρρίκνωση πληροφοριών ομάδας και σημεία συνάντησης',
    expandTeam: 'Επέκταση τις πληροφορίες ομάδας και τα σημεία συνάντησης',
    noParticipants: 'Δεν υπάρχουν συμμετέχοντες',
    requestTeam: 'Αίτηση συμμετοχής',
    requestTeamAgain: 'Ξανά αίτηση συμμετοχής',
    requests: 'Αιτήσεις',
    cancelRequest: 'Απόσυρση της αίτησης',
    cancelParticipation: 'Ακύρωση συμμετοχής',
    addParticipant: 'Προσθήκη ευαγγελιζομένου',
    closedTeam: 'Αυτή η ομάδα είναι κλειστή. Δεν μπορείτε να υποβάλετε αίτηση',
    maximumReached: 'Το μέγιστο όριο για την ομάδα έχει ήδη επιτευχθεί',
    noPermission: 'Δεν έχεις το δικαίωμα να διοργανώνεις άλλους χρήστες',
    noTeamleader: 'Αυτός ο ευαγγελιζόμενος δεν έχει άδεια αρχηγού ομάδας',
    alreadyTeamleader: 'Αυτός ο ευαγγελιζόμενος είναι ήδη αρχηγός ομάδας',
    openTeam: 'Άνοιγμα ομάδας',
    closeTeam: 'Κλείσιμο ομάδας',
    switch: 'Επεξεργασία βαρδιών',
    existingTeamleaders: 'Διατίθεται αρχηγός ομάδας',
    noExistingTeamleader: 'Λείπει αρχηγός ομάδας',
    notTeamleader: 'Δεν υπάρχει ηγέτης ομάδας',
    selected: 'Επιλεγμένα:',
    of: 'απο',
    approveSelected: 'Έγκριση επιλεγμένων',
    declineSelected: 'Απόρριψη  επιλεγμένων',
    removeSelected: 'Αφαίρεση επιλεγμένων',
    report: 'Έκθεση'
  },
  shiftReport: {
    title: 'Έκθεση',
    teamleader: 'Αρχηγός ομάδας',
    substituteTeamleader: 'Αναπληρωτής αρχηγός ομάδας',
    publications: 'Εκδόσεις ',
    occurrences: 'Συμβάντα',
    store: 'Αποθήκη',
    experiences: 'Εμπειρίες',
    present: 'Παρόν',
    sick: 'Άρρωστος',
    missing: 'Απόν',
    name: 'Όνομα',
    language: 'Γλώσσα',
    count: 'Αριθμός',
    action: 'Δράση',
    noPublications: 'Δεν υπάρχουν διαθέσιμες εκδόσεις',
    select_publication: 'Επιλογή εκδόσεων',
    selectPublicationFirst: 'Επιλέξτε πρώτα την έκδοση',
    plusIconReminder: 'Μην ξεχάσεις να πατήσετε το πλήκτρο συν (+)',
    addItem: 'Προσθήκη αυτής της εκδόσεις',
    removeItem: 'Διαγραφή αυτής της εκδόσεις',
    texts: 'Γραφικά εδάφια',
    speaks: 'Συζητήσεις',
    videos: 'Εμφανόμενα βίντεο',
    website: 'Δείχτηκε ο ιστότοπος',
    returnVisits: 'Επανεπισκέψεις',
    bibleStudies: 'Γραφικές μελέτες',
    time: 'Ώρες εργού',
    trolleysFilled: 'Τα τρόλεϊ ήταν γεμάτα',
    neatnessLast: 'Κατάσταση τρόλεϊ μετά την τελευταία βάρδια',
    bad: 'Χάλια',
    normal: 'Κανονικά',
    good: 'Καλά',
    yes: 'Ναι',
    no: 'Όχι',
    expRoute: 'Διαδρομή',
    expGood: 'Ωραίες εμπειρίες',
    expProblems: 'Προβλήματα / δυσκολίες',
    date: 'Ημερομηνία',
    toShift: 'Βάρδια',
    pages: {
      publisher: 'Ευαγγελιζόμενος',
      items: 'Διανεμόμενα έντυπα',
      occurrences: 'Συμβάντα που συνέβησαν',
      store: 'Σχετικά με την αποθήκη',
      experiences: 'Εμπειρίες',
      prevPage: 'Προηγούμενη σελίδα',
      nextPage: 'Επόμενη σελίδα',
      finish: 'Διανομή εκθέσεις'
    }
  },
  route: {
    title: 'Δημιουργία / επεξεργασία διαδρομής',
    routeMarkers: 'Δείκτης διαδρομής',
    addRouteMarkers: 'Κάνε κλικ στο χάρτη για να προσθέσεις νέους δείκτες διαδρομής'
  },
  uploadUserFile: {
    title: 'Μεταφόρτωση αρχείου χρήστη',
    helpEncoding: 'Το αρχείο πρέπει να αποθηκευτεί σε μορφή UTF-8 έτσι ώστε όλοι οι χαρακτήρες να εμφανίζονται σωστά!',
    uploadFile: 'Μεταφόρτωση αρχείου CSV',
    name: 'Όνομα',
    email: 'Εmail',
  },
  mergeAccounts: {
    title: 'Συγχώνευση λογαριασμών',
    description: 'Πληκτρολογήστε εδώ τα διαπιστευτήρια του λογαριασμού στον οποίο θέλετε να μεταφέρετε τα δικαιώματα του τρέχοντος λογαριασμού. Θα συνδεθείτε απευθείας με τον καθορισμένο λογαριασμό.',
    username: 'Όνομα Χρήστη',
    password: 'Κωδικός πρόσβασης',
    merge: 'Μεταφορά τον δικαιωμάτων'
  }
}

export default modal
