const pages = {
  profile: {
    name: 'Το προφίλ μου',
    personalData: 'Τα στοιχεία μου',
    changePicture: 'Αλλαγή εικόνας...',
    options: {
      title: 'Επιλογές',
      helpText: {
        mergeAccounts: 'Στο JW Management χρειάζεσαι μόνο έναν λογαριασμό για όλα. Μόνο που πρέπει να θυμάσαι είναι ένα όνομα χρήστη και έναν κωδικό πρόσβασης. Εάν έχετε πολλούς λογαριασμούς, κάντε κλικ στην επιλογή " Μεταφορά δικαιωμάτων". Καταχωρίστε τα διαπιστευτήρια του δεύτερου λογαριασμού σας. Στη συνέχεια, τα δικαιώματα αυτού του λογαριασμού μεταφέρονται στον συγκεκριμένο λογαριασμό.'
      }
    },
    availability: {
      title: 'Διαθεσιμότητα',
      helpText: 'Σημείωσε τις ώρες στις οποίες είσαι διαθέσιμος',
      shortTermCalls: 'Επιτρέπω την βραχυπρόθεσμοι επαφή',
      shortTermCallsAlways: 'Ακόμη και αν δεν έχω δηλώσει καμία διαθεσιμότητα'
    },
    speaks: 'Μιλάει',
    telefon: 'Αρ.τηλ.',
    congregation: 'Εκκλησία',
    language: 'Γλώσσα λογαριασμού',
    languages: 'Ξένες γλώσσες',
    gender: 'Φύλο',
    _gender: {
      brother: 'Αδελφός',
      sister: 'Αδελφή'
    },
    publisher: 'Ευαγγελιζόμενος',
    privilegeOfService: 'Προνόμιο υπηρεσίας',
    _privilegeOfService: {
      auxiliaryPioneer: 'Βοηθητικός σκαπανέας',
      pioneer: 'Σκαπανέας',
      specialPioneer: 'Ειδικός σκαπανέας',
      circuitOverseer: 'Επίσκοπος περιοχής',
      bethelite: 'Μπεθελίτις',
      fulltimeConstructionServant: 'LDC Εθελοντής οικοδόμησης'
    },
    ministryPrivilege: 'Εκκλησιαστική διορισμοί',
    _ministryPrivilege: {
      ministerialServant: 'Διακονικός υπηρέτης',
      elder: 'Πρεσβύτερος',
      coordinator: 'Συντονιστής',
      secretary: 'Γραμματέας',
      serviceOverseer: 'Επίσκοπος υπηρεσίας'
    },
    placeholder: {
      telefon: '(π.χ. +30 3011 1234567)',
      congregation: 'Αθήνα Β.',
      languages: 'Αγγλική, Γαλλική, Ρωσική'
    },
    changePassword: 'Αλλαγή Κωδικού Πρόσβασης',
    deleteAccount: 'Διαγραφή λογαριασμού',
    mergeAccounts: 'Μεταφορά δικαιωμάτων',
    vacation: {
      title: 'Διακοπές',
      helpText: 'Παρακαλούμε να αναφέρεις τις περιόδους κατά τις οποίες δεν είσαι διαθέσιμος.'
    },
    until: 'μέχρι',
    addVacation: 'Εισαγωγή νέων διακοπών',
    deleteVacation: 'Ακύρωση διακοπών',
    usernameTaken: 'Αυτό το όνομα χρήστη χρησιμοποιείται ήδη. Επιλέξτε ένα διαφορετικό όνομα.'
  },
  wiki: {
    name: 'Πληροφορίες',
    nameShort: 'Πληροφορίες',
    files: 'Αρχεία',
    addQuestion: 'Προσθήκη ερώτησης/τίτλου',
    edit: 'Επεξεργασία',
    delete: 'Διαγραφή',
    noFiles: 'Δεν υπάρχουν διαθέσιμα αρχεία',
    addTab: 'Προσθήκη νέας καρτέλας',
    editQuestion: 'Επεξεργασία τίτλου',
    removeFaq: 'Διαγραφή τίτλου',
    editFaq: 'Επεξεργασία απάντησης',
    changeFaq: 'Αποθήκευση αλλαγών',
    cancelFaq: 'Ακύρωση αλλαγών'
  },
  shifts: {
    name: 'Βάρδιες',
    route: 'Διαδρομή',
    addShift: 'Προσθήκη βάρδιας',
    deleteWeek: 'Διαγραφή ολόκληρης της εβδομάδας',
    addWeek: 'Δημιουργία νέας εβδομάδας ',
    requests: 'Αιτήσεις',
    openRequests: 'Ανοιχτές αιτήσεις',
    automation: 'Αυτοματισμός',
    template: 'Πρότυπο',
    noVisibleShifts: 'Δεν βρέθηκαν βάρδιες αυτής της κατηγορίας σε αυτήν την εβδομάδα',
    start: 'Αρχή',
    end: 'Τέλος',
    visibility: 'Ορατότητα:',
    helpText: {
      start: 'Αυτή είναι η πρώτη εβδομάδα που θα δημιουργήσει το σύστημα.',
      end: 'Αυτή είναι η τελευταία εβδομάδα που θα δημιουργήσει το σύστημα.',
      visibility: 'Αυτό καθορίζει πόσες εβδομάδες πριν οι αδελφοί μπορούν να υποβάλουν αίτηση. Το σύστημα δημιουργεί τις απαραίτητες βάρδιες, λαμβάνοντας υπόψη τις εβδομάδες έναρξης και λήξης.'
    },
    weeks: 'Εβδομάδες',
    sendWeek: 'Αποστολή διορισμού',
    hideNames: 'Απόκρυψη συμμέτοχων βάρδιας',
    showNames: 'Ένδειξη συμμέτοχων βάρδιας',
    editShifts: 'Επεξεργασία βαρδιών',
    prevWeek: 'Προηγούμενη εβδομάδα',
    nextWeek: 'Επόμενη εβδομάδα',
    shownTag: 'Εμφανίζονται η βάρδιες αυτής της κατηγορίας',
    hiddenTag: 'Κρύβονται η βάρδιες αυτής της κατηγορίας',
    shift: {
      tag: 'Κατηγορία',
      schedule: 'Ταξινόμηση',
      teamleader: 'Αρχηγός ομάδας',
      teams: 'Ομάδες',
      noTeams: 'Δεν υπάρχουν ομάδες',
      participants: 'Συμμέτοχος',
      start: 'Αρχή',
      end: 'Τέλος',
      requests: 'Αιτήση',
      requests_plural: 'Αιτήσεις',
      requestsOf: 'Αιτήση απο',
      requestsOf_plural: 'Αιτήσεις απο',
      teamleaders: 'Αρχηγοί ομάδων',
      noPermission: 'Μόνο ένας Διευθυντής έργου ή Υπεύθυνος για την οργάνωση της βάρδιας επιτρέπεται να επεξεργάζεται τις βάρδιες.'
    }
  },
  day: {
    removeAll: 'Διαγραφή όλων'
  },
  reports: {
    export: 'Εξαγωγή ως CSV'
  },
  settings: {
    main: {
      title: 'Γενικές ρυθμίσεις',
      id: 'ID',
      name: {
        text: 'Όνομα',
        placeholder: 'Όνομα του πρότζεκτ',
        helpText: 'Το όνομα του πρότζεκτ στις περισσότερες περιπτώσεις είναι το όνομα της εκκλησίας. Για μεγαλύτερα πρότζεκτ, περιγράφει το όνομα της πόλης στην οποία εκτελείται. Εάν το πρότζεκτ δεν συνδέεται άμεσα με την υπηρεσία τρόλεϊ, το είδος της υπηρεσίας μπορεί να περιλαμβάνεται στο όνομα.'
      },
      news: {
        text: 'Ειδήσεις',
        placeholder: 'Δεν βρέθηκε καμία είδηση',
        helpText: 'Οι ειδήσεις εμφανίζονται σε όλους τους συμμετέχοντες στο πάνω μέρος της επισκόπησης.'
      },
      email: {
        text: 'Email',
        placeholder: 'Email του πρότζεκτ',
        helpText: 'Για email σχετικά με τις αποδεκτές βάρδιες, τις επικεφαλίδες ομάδων κ.λπ., αυτό το email θα οριστεί ως replyTo. Απαντήσεις σε αυτά τα email θα καταλήξουν στο γραμματοκιβώτιο αυτού του email. Επιπλέον, αυτό το email ενημερώνεται π.χ. σε περίπτωση βραχυπρόθεσμων ακυρώσεων.'
      },
      language: {
        text: 'Γλώσσα',
        helpText: 'Όταν το σύστημα στέλνει ειδοποιήσεις στην παραπάνω διεύθυνση, θα χρησιμοποιηθεί η γλώσσα που καθορίζετε εδώ.'
      },
      deleteProject: 'Διαγραφή του πρότζεκτ'
    },
    tags: {
      title: 'Κατηγορίες',
      helpText: '<p>Κάθε βάρδια πρέπει να συνδεθεί με μια κατηγορία. Επιπλέον, κάθε συμμετέχων μπορεί να είναι ή να μην είναι επιλέξιμος για ορισμένες κατηγορίες. Ο παρευρισκόμενος βλέπει μόνο τις βάρδιες που έχουν ανατεθεί σε μια κατηγορία για την οποία δικαιούται.</p><p>Οι κατηγορίες μπορούν να χρησιμοποιηθούν για τη οργάνωση διαφόρων δραστηριοτήτων (π.χ., τρόλεϊ, περίπτερο πληροφοριών, υπηρεσία ταξιθεσίας, υπηρεσία στάθμευσης κλπ.). Η διαίρεση των βαρδιών σε διαφορετικές κατηγορίες μπορεί να έχει νόημα εάν τα στρώματα θα αλληλεπικαλύπτονταν χρονικά.</p><p>Σε κάθε κατηγορία μπορούν να οριστούν περισσότερες εβδομάδες προτύπου.</p>',
      id: 'ID',
      name: 'Όνομα',
      img: {
        name: 'Εικόνα',
        helpText: 'Αυτή η εικόνα εμφανίζεται στην επισκόπηση όταν κάνετε κλικ στο \'Βάρδιες\'. Θα πρέπει να αντιπροσωπεύει τον σκοπό τις βάρδιας σε αυτήν την κατηγορία. Αν θέλεις να συμπεριλαμβάνουμε η δική σου εικόνα, στείλε μας ένα email με την πρότασή σου στο mailto:support@jwmanagement.org.'
      },
      templates: 'Πρότυπο εβδομάδας',
      showTemplate: 'Επεξεργασία βαρδιών ',
      editTemplate: 'Αλλαγή ονόματος',
      removeTemplate: 'Διαγραφή',
      addTemplate: 'Δημιουργία νέου πρότυπου',
      action: 'Δράση',
      none: 'Δεν έχουν δημιουργηθεί ακόμα κατηγορίες',
      add: 'Δημιουργία νέας κατηγορίας',
      remove: 'Διαγραφή κατηγορίας'
    },
    teams: {
      title: 'Ομάδες',
      helpText: {
        main: 'Μέσα σε μια βάρδια μπορούνε να υπάρχουν μία ή περισσότερες ομάδες. Κάθε ομάδα έχει μια διαδρομή. Ένας ευαγγελιζόμενος ανήκει πάντοτε σε μια ομάδα. Εάν επιτρέπεται στη συγκεκριμένη βάρδια, μπορεί επίσης να υποβάλει αίτηση για ειδικές ομάδες αντί μόνο για ολόκληρη τη βάρδια.',
        picture: 'Αυτήν την εικόνα μπορούν να την δούνε οι ευαγγελιζομένη. Θα πρέπει να περιέχει περισσότερες πληροφορίες σχετικά με την δραστηριότητα της ομάδας. Για παράδειγμα, μπορείς να προσθέσεις μια εικόνα της διαδρομής τρόλεϊ (Google Maps).',
        link: 'Αυτός ο σύνδεσμος θα συνδεθεί με την εικόνα. Όταν ο χρήστης κάνει κλικ στην εικόνα, κατευθύνεται σε αυτήν τη σελίδα. Για παράδειγμα, μπορείς να προσθέσεις μια εικόνα της διαδρομής στο Google MyMaps και να συνδέσεις τον σύνδεσμο του χάρτη.',
        description: 'Εδώ μπορείς να προσθέσεις μια περιγραφή για αυτήν την ομάδα. Για παράδειγμα, θα μπορούσατε να εξηγήσετε μερικές λεπτομέρειες για αυτή τη διαδρομή.'
      },
      id: 'ID',
      name: 'Όνομα',
      icon: 'Εικόνισμα',
      picture: 'Εικόνα',
      editPicture: 'Προσθήκη εικόνας για αυτήν την ομάδα',
      noPicture: 'Δεν βρέθηκε διαθέσιμη εικόνα',
      link: 'Σύνδεσμος',
      description: 'Περιγραφή',
      action: 'Δράση',
      none: 'Δεν έχουν δημιουργηθεί ακόμα ομάδες',
      add: 'Δημιουργία νέας ομάδας',
      remove: 'Διαγραφή ομάδας'
    },
    meetings: {
      title: 'Σημεία συνάντησης',
      helpText: {
        main: 'Στις ομάδες μπορούν να ανατεθούν σημεία συνάντησης σε κάθε βάρδια. Αυτό επιτρέπει στις μεμονωμένες ομάδες να συναντιούνται ανεξάρτητα. Αυτό μπορεί να είναι χρήσιμο εάν οι διαδρομές των ομάδων απέχουν τόσο πολύ από το ότι ένα κοινό σημείο συνάντησης για ολόκληρη τη μετατόπιση θα ήταν πολύ χρονοβόρο. Οι σημεία συναντήσεων ορίζονται με συντεταγμένες.',
        picture: 'Αυτήν την εικόνα μπορούν να την δούνε οι ευαγγελιζομένη. Θα πρέπει να περιέχει περισσότερες πληροφορίες σχετικά με τον τόπο συνάντησης. Για παράδειγμα, μπορείς να προσθέσεις μια εικόνα του περιβάλλου (Google Maps).'
      },
      id: 'ID',
      name: 'Όνομα',
      picture: 'Εικόνα',
      editPicture: 'Προσθήκη εικόνας του σημείου συνάντησης',
      noPicture: 'Δεν βρέθηκε διαθέσιμη εικόνα',
      action: 'Δράση',
      none: 'Δεν έχουν δημιουργηθεί ακόμη σημεία συνάντησης',
      add: 'Δημιουργία νέου σημείου συναντήσεις',
      remove: 'Διαγραφή σημείου συναντήσεις'
    }
  }
}

export default pages
