const publisher = {
  entity: {
    username: 'Όνομα Χρήστη',
    profile: {
      firstname: 'Όνομα',
      lastname: 'Επώνυμο',
      email: 'Email',
      telefon: 'Αρ.τηλ.',
      gender: 'Φύλο',
      genderValues: {
        m: 'Αδελφός',
        w: 'Αδελφή'
      },
      congregation: 'Εκκλησία',
      pioneer: 'Προνόμιο υπηρεσίας',
      pioneerValues: {
        publisher: 'Ευαγγελιζόμενος',
        auxiliary: 'Βοηθητικός σκαπανέας',
        regular: 'Σκαπανέας',
        special: 'Ειδικός σκαπανέας',
        circuit: 'Επίσκοπος περιοχής',
        bethelite: 'Μπεθελίτις',
        ldc: 'LDC Εθελοντής οικοδόμησης'
      },
      privilege: 'Εκκλησιαστική διορισμοί',
      privilegeValues: {
        publisher: 'Ευαγγελιζόμενος',
        servant: 'Διακονικός υπηρέτης',
        elder: 'Πρεσβύτερος',
        coordinator: 'Συντονιστής',
        secretary: 'Γραμματέας',
        serviceOverseer: 'Επίσκοπος υπηρεσίας'
      },
      language: 'Γλώσσα λογαριασμού',
      languageValues: {
        de: 'Γερμανική',
        en: 'Αγγλική',
        fi: 'Φινλανδική',
        fr: 'Γαλλική (εν μέρει)',
        hu: 'Ουγγρική',
        it: 'Ιταλικά',
        pl: 'Πολωνική',
        pt: 'Πορτογαλικά',
        ru: 'Ρωσική',
        'el-GR': 'Ελληνική',
        'zh-TW': 'Κινέζικα (Παραδοσιακά) (εν μέρει)',
        'zh-CN': 'Κινέζικα (Απλοποιημένα) (εν μέρει)'
      },
      languages: 'Ξένες γλώσσες',
      shortTermCalls: 'Ενημέρωση αν η βάρδια δεν έχει καλυφθεί',
      shortTermCallsAlways: 'Διατεθειμένος βραχυπρόθεσμα',
      availability: {
        'new': 'Εισαγωγή νέας διαθεσιμότητας',
        noElements: 'Δεν βρέθηκαν διαθεσιμότητες',
        methodConfirmation: 'Θέλεις πραγματικά να διαγράψεις αυτήν τη διαθεσιμότητα;',
        mondays: 'Δευτέρα',
        tuesdays: 'Τρίτη',
        wednesdays: 'Τετάρτη',
        thursdays: 'Πέμπτη',
        fridays: 'Παρασκευή',
        saturdays: 'Σάββατο',
        sundays: 'Κυριακή',
        start: 'Αρχή',
        startDateFormat: 'H -',
        startValues: {
          '0': '0:00 ώρα',
          '1': '1:00 ώρα',
          '2': '2:00 ώρα',
          '3': '3:00 ώρα',
          '4': '4:00 ώρα',
          '5': '5:00 ώρα',
          '6': '6:00 ώρα',
          '7': '7:00 ώρα',
          '8': '8:00 ώρα',
          '9': '9:00 ώρα',
          '10': '10:00 ώρα',
          '11': '11:00 ώρα',
          '12': '12:00 ώρα',
          '13': '13:00 ώρα',
          '14': '14:00 ώρα',
          '15': '15:00 ώρα',
          '16': '16:00 ώρα',
          '17': '17:00 ώρα',
          '18': '18:00 ώρα',
          '19': '19:00 ώρα',
          '20': '20:00 ώρα',
          '21': '21:00 ώρα',
          '22': '22:00 ώρα',
          '23': '23:00 ώρα'
        },
        end: 'Τέλος',
        endDateFormat: 'H [ώρα]',
        endValues: {
          '0': '1:00 ώρα',
          '1': '2:00 ώρα',
          '2': '3:00 ώρα',
          '3': '4:00 ώρα',
          '4': '5:00 ώρα',
          '5': '6:00 ώρα',
          '6': '7:00 ώρα',
          '7': '8:00 ώρα',
          '8': '9:00 ώρα',
          '9': '10:00 ώρα',
          '10': '11:00 ώρα',
          '11': '12:00 ώρα',
          '12': '13:00 ώρα',
          '13': '14:00 ώρα',
          '14': '15:00 ώρα',
          '15': '16:00 ώρα',
          '16': '17:00 ώρα',
          '17': '18:00 ώρα',
          '18': '19:00 ώρα',
          '19': '20:00 ώρα',
          '20': '21:00 ώρα',
          '21': '22:00 ώρα',
          '22': '23:00 ώρα',
          '23': '0:00 ώρα'
        },
        wholeDay: 'Ολόκληρη η μέρα'
      },
      vacation: {
        start: 'Αρχή',
        end: 'Τέλος',
        'new': 'Εισαγωγή νέων διακοπών',
        noElements: 'Δεν έχουν εγγραφεί διακοπές',
        methodConfirmation: 'Θέλεις πράγματι να διαγράψεις αυτές τις διακοπές;',
        startDateFormat: 'DD/MM/YYYY [μέχρι]',
        endDateFormat: 'DD/MM/YYYY'
      }
    },
    password: {
      change: 'Αλλαγή Κωδικού Πρόσβασης',
      reset: 'Αποστολή μηνύματος επαναφοράς κωδικού πρόσβασης',
      resetConfirmation: 'Θέλεις πράγματι να στείλεις ένα μήνυμα επαναφοράς κωδικού πρόσβασης σε αυτόν τον ευαγγελιζόμενο;',
      password: 'Νέος Κωδικός Πρόσβασης',
      passwordRepeat: 'Επαν. Κωδικού Πρόσβασης'
    },
    permissions: {
      permissions: 'Δικαιώματα',
      project: 'Δικαιώματα του έργου',
      projectValues: {
        admin: 'Διευθυντής έργου',
        shiftScheduler: 'Υπεύθυνος για την οργάνωση της βάρδιας',
        shiftAdmin: 'Υπεύθυνος της βάρδιας',
        storeAdmin: 'Υπεύθυνος της αποθήκης',
        member: 'Συμμέτοχος'
      },
      tag: {
        tag: 'Ετικέτα',
        role: 'Ρόλος',
        noElements: 'Δεν έχουν επιλεχτεί δικαιώματα',
        roleValues: {
          teamleader: 'Αρχηγός ομάδας',
          substituteTeamleader: 'Αναπληρωτής αρχηγός ομάδας',
          participant: 'Συμμέτοχος',
          none: 'Tίποτα'
        }
      }
    },
    status: {
      lastLogin: {
        date: 'Τελευταία σύνδεση'
      }
    },
    invite: 'Αποστολή πρόσκλησης',
    inviteConfirmation: 'Θέλεις πράγματι να προσκαλέσεις αυτόν τον ευαγγελιζόμενο στο έργο;',
    delete: 'Αφαίρεση ευαγγελιζομένου από το έργο',
    deleteConfirmation: 'Θέλεις να αφαίρεσης πράγματι αυτόν τον ευαγγελιζόμενο από αυτό το έργο;'
  },
  search: { placeholder: 'Όνομα, Επώνυμο, email, Αρ.τηλ. ή Όνομα Χρήστη' },
  details: {
    sections: {
      identification: 'Τα στοιχεία ταυτότητας',
      availability: 'Διαθεσιμότητα',
      vacations: 'Διακοπές',
      password: 'Κωδικός Πρόσβασης',
      permissions: 'Δικαιώματα',
      options: 'Επιλογές'
    }
  },
  profile: {
    availability: {
      details: {
        sections: {
          mondays: 'Διαθεσιμότητα Δευτέρες',
          tuesdays: 'Διαθεσιμότητα Τρίτες',
          wednesdays: 'Διαθεσιμότητα Τετάρτες',
          thursdays: 'Διαθεσιμότητα Πέμπτες',
          fridays: 'Διαθεσιμότητα Παρασκευές',
          saturdays: 'Διαθεσιμότητα Σάββατα',
          sundays: 'Διαθεσιμότητα Κυριακές'
        }
      }
    },
    permissions: {
      details: {
        sections: {
          permissions: {
            project: 'Δικαιώματα του έργου',
            tags: 'Ετικέτα Δικαιώματα'
          }
        }
      },
      tag: {
        details: {
          sections: {
            permissions: {
              tag: 'Ετικέτα Δικαιώματα'
            }
          }
        }
      }
    }
  }
}

export default publisher
